app/views/frm_topics/show.html.erb

SELECT "frm_posts".* FROM "frm_posts" WHERE "frm_posts"."frm_topic_id" = 7 ORDER BY created_at ASC
---
    <table>
      <% @topic.frm_posts.each do |post| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
          <span class="info smaller">
            <%= t(:posts) %> <%= post.user.frm_posts.size %><br />