app/views/forums/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY position ASC
---
        <span class="input indent smaller">
          <%= f.collection_select :category_id, Category.all, :id, :title %>