app/views/forums/show.html.erb

      </tr>
      <% @forum.topics.each do |topic| %>
---
SELECT "topics".* FROM "topics" WHERE ("topics".forum_id = 2) ORDER BY sticky DESC, updated_at DESC

        </td>
        <td class="counts smaller"><%= topic.posts.size - 1 %></td>
---
SELECT "posts".* FROM "posts" WHERE ("posts".topic_id = 2) ORDER BY created_at DESC LIMIT 1