app/views/topics/show.html.erb

SELECT "posts".* FROM "posts" WHERE ("posts".topic_id = 2) ORDER BY created_at ASC
---
    <table>
      <% @topic.posts.each do |post| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
          <span class="info smaller">
            <%= t(:posts) %> <%= post.user.posts.size %><br />