app/views/frm_forums/_form.html.erb

        <span class="input indent smaller">
          <%= f.collection_select :frm_category_id, FrmCategory.all, :id, :title %>
---
SELECT "frm_categories".* FROM "frm_categories" ORDER BY position ASC