app/views/frm_forums/show.html.erb

SELECT "frm_topics".* FROM "frm_topics" WHERE "frm_topics"."frm_forum_id" = 14 ORDER BY sticky DESC, updated_at DESC
---
      </tr>
      <% @forum.frm_topics.each do |topic| %>