app/controllers/frm_categories_controller.rb

  def index
    @categories = FrmCategory.all
---
SELECT "frm_categories".* FROM "frm_categories" ORDER BY position ASC

  def create
    @category = FrmCategory.new(params[:frm_category])
    if @category.save
---
INSERT INTO "frm_categories" ("created_at", "position", "state", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 30 Dec 2012 19:20:51 UTC +00:00], ["position", 0], ["state", true], ["title", "Econometria"], ["updated_at", Sun, 30 Dec 2012 19:20:51 UTC +00:00]]

  def edit
    @category = FrmCategory.find(params[:id])
---
SELECT "frm_categories".* FROM "frm_categories" WHERE "frm_categories"."id" = ? ORDER BY position ASC LIMIT 1  [["id", "4"]]

  def update
    @category = FrmCategory.find(params[:id])

    if @category.update_attributes(params[:frm_category])
---
SELECT "frm_categories".* FROM "frm_categories" WHERE "frm_categories"."id" = ? ORDER BY position ASC LIMIT 1  [["id", "4"]]
UPDATE "frm_categories" SET "title" = 'Curso de Prueba', "updated_at" = '2012-12-30 13:09:14.347865' WHERE "frm_categories"."id" = 6

  def destroy
    @category = FrmCategory.find(params[:id])

    if @category.destroy
---
SELECT "frm_categories".* FROM "frm_categories" WHERE "frm_categories"."id" = ? ORDER BY position ASC LIMIT 1  [["id", "6"]]
DELETE FROM "frm_categories" WHERE "frm_categories"."id" = ?  [["id", 6]]