app/controllers/frm_topics_controller.rb

  def show
    @topic = FrmTopic.find(params[:id])
---
SELECT "frm_topics".* FROM "frm_topics" WHERE "frm_topics"."id" = ? ORDER BY sticky DESC, updated_at DESC LIMIT 1  [["id", "7"]]

  def new
    @forum = FrmForum.find(params[:frm_forum_id])
---
SELECT "frm_forums".* FROM "frm_forums" WHERE "frm_forums"."id" = ? ORDER BY position ASC LIMIT 1  [["id", "14"]]

  def create
    @forum = FrmForum.find(params[:frm_forum_id])
    @topic = @forum.frm_topics.build(params[:frm_topic])
    @topic.user = current_user

    if @topic.save
---
SELECT "frm_forums".* FROM "frm_forums" WHERE "frm_forums"."id" = ? ORDER BY position ASC LIMIT 1  [["id", "14"]]
INSERT INTO "frm_topics" ("created_at", "frm_forum_id", "frm_posts_count", "hits", "locked", "sticky", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @topic = FrmTopic.find(params[:id])
---
SELECT "frm_topics".* FROM "frm_topics" WHERE "frm_topics"."id" = ? ORDER BY sticky DESC, updated_at DESC LIMIT 1  [["id", "7"]]

  def update
    @topic = FrmTopic.find(params[:id])
    if @topic.update_attributes(params[:frm_topic])
---
SELECT "frm_topics".* FROM "frm_topics" WHERE "frm_topics"."id" = ? ORDER BY sticky DESC, updated_at DESC LIMIT 1  [["id", "7"]]
UPDATE "frm_topics" SET "title" = 'Apuntes adicionales', "updated_at" = '2012-12-30 13:20:57.892943' WHERE "frm_topics"."id" = 7

  def destroy
    @topic = FrmTopic.find(params[:id])

    if @topic.destroy
---
SELECT "frm_topics".* FROM "frm_topics" WHERE "frm_topics"."id" = ? ORDER BY sticky DESC, updated_at DESC LIMIT 1  [["id", "7"]]
DELETE FROM "frm_topics" WHERE "frm_topics"."id" = ?  [["id", 7]]