app/controllers/frm_posts_controller.rb

SELECT "frm_topics".* FROM "frm_topics" WHERE "frm_topics"."id" = ? ORDER BY sticky DESC, updated_at DESC LIMIT 1  [["id", "7"]]
SELECT "frm_posts".* FROM "frm_posts" WHERE "frm_posts"."id" = ? ORDER BY created_at ASC LIMIT 1  [["id", "21"]]
---
  def new
    @topic = FrmTopic.find(params[:frm_topic_id])
    @post = FrmPost.new

    if params[:quote]
      quote_post = FrmPost.find(params[:quote])

SELECT "frm_topics".* FROM "frm_topics" WHERE "frm_topics"."id" = ? ORDER BY sticky DESC, updated_at DESC LIMIT 1  [["id", "7"]]
INSERT INTO "frm_posts" ("body", "created_at", "frm_forum_id", "frm_topic_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Sin comentarios"], ["created_at", Sun, 30 Dec 2012 21:41:55 UTC +00:00], ["frm_forum_id", 2], ["frm_topic_id", 2], ["updated_at", Sun, 30 Dec 2012 21:41:55 UTC +00:00], ["user_id", 1]]
---
  def create
    @topic = FrmTopic.find(params[:frm_topic_id])
    @post = @topic.frm_posts.build(params[:frm_post])
    @post.frm_forum = @topic.frm_forum
    @post.user = current_user

    if @post.save

SELECT "frm_posts".* FROM "frm_posts" WHERE "frm_posts"."id" = ? ORDER BY created_at ASC LIMIT 1  [["id", "20"]]
---
  def edit
    @post = FrmPost.find(params[:id])

SELECT "frm_posts".* FROM "frm_posts" WHERE "frm_posts"."id" = ? ORDER BY created_at ASC LIMIT 1  [["id", "20"]]
UPDATE "frm_posts" SET "body" = 'Sin comentarios al sin comentario adecuado', "updated_at" = '2012-12-30 21:42:32.001594' WHERE "frm_posts"."id" = 4
---
  def update
    @post = FrmPost.find(params[:id])

    if @post.update_attributes(params[:frm_post])

SELECT "frm_posts".* FROM "frm_posts" WHERE "frm_posts"."id" = ? ORDER BY created_at ASC LIMIT 1  [["id", "25"]]
DELETE FROM "frm_posts" WHERE "frm_posts"."id" = ?  [["id", 22]]
---
  def destroy
    @post = FrmPost.find(params[:id])

    if @post.frm_topic.frm_posts_count > 1
      if @post.destroy