app/controllers/frm_forums_controller.rb

  def show
    @forum = FrmForum.find(params[:id])
---
SELECT "frm_forums".* FROM "frm_forums" WHERE "frm_forums"."id" = ? ORDER BY sticky, position ASC LIMIT 1  [["id", "22"]]

  def create
    @forum = FrmForum.new(params[:frm_forum])
    if @forum.save
---
INSERT INTO "frm_forums" ("created_at", "description", "frm_category_id", "frm_posts_count", "frm_topics_count", "position", "state", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @forum = FrmForum.find(params[:id])
---
SELECT "frm_forums".* FROM "frm_forums" WHERE "frm_forums"."id" = ? ORDER BY position ASC LIMIT 1  [["id", "21"]]

  def update
    @forum = FrmForum.find(params[:id])
    if @forum.update_attributes(params[:frm_forum])
---
SELECT "frm_forums".* FROM "frm_forums" WHERE "frm_forums"."id" = ? ORDER BY position ASC LIMIT 1  [["id", "21"]]
UPDATE "frm_forums" SET "title" = 'Otro tema dificil', "updated_at" = '2012-12-30 21:24:32.310847' WHERE "frm_forums"."id" = 2

  def destroy
    @forum = FrmForum.find(params[:id])

    if @forum.destroy
---
SELECT "frm_forums".* FROM "frm_forums" WHERE "frm_forums"."id" = ? ORDER BY position ASC LIMIT 1  [["id", "18"]]
DELETE FROM "frm_forums" WHERE "frm_forums"."id" = ?  [["id", 18]]