app/views/categories/index.html.erb

    </div>
    <% if category.forums.size > 0 %>
---
SELECT "forums".* FROM "forums" WHERE ("forums".category_id = 1) ORDER BY position ASC
SELECT COUNT(*) FROM "forums" WHERE ("forums".category_id = 1)

          <td class="counts smaller"><%= forum.topics.size %></td>
          <td class="counts smaller"><%= forum.posts.size - forum.topics.size %></td>
---
SELECT "posts".* FROM "posts" INNER JOIN "topics" ON "posts"."topic_id" = "topics"."id" WHERE "topics"."forum_id" = 2 ORDER BY created_at DESC, sticky ASC, updated_at ASC LIMIT 1